app/views/posts/show.html.erb

<!-- Syntax below shows ALL the comments. -->
<% @post.comments.each do |comment| %>
---
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = ?  [["post_id", 6]]