app/controllers/comments_controller.rb

INSERT INTO "comments" ("user_id", "post_id", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["user_id", 18], ["post_id", 6], ["body", "ahaskjflhkvjx"], ["created_at", 2017-05-30 21:50:33 UTC], ["updated_at", 2017-05-30 21:50:33 UTC]]
---
  def create
   @comment = Comment.new(comment_params)
   @comment.post_id = params[:post_id]
   @comment.user_id = session[:user_id]
   if @comment.save