app/controllers/posts_controller.rb

def create
  @post = Post.create(
       user_id: session[:user_id],
       title: params[:post][:title],
       content: params[:post][:content]
     )
---
INSERT INTO "posts" ("title", "user_id", "content", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "thanks"], ["user_id", 3], ["content", "isaac"], ["created_at", 2017-04-30 20:10:33 UTC], ["updated_at", 2017-04-30 20:10:33 UTC]]

def show
  @post = Post.find(params[:id])
  @user = User.find(@post.user_id)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]