app/controllers/sessions_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."uname" = ? ORDER BY "users"."id" ASC LIMIT ?  [["uname", "Leila"], ["LIMIT", 1]]
---
  def create
    @user = User.where(uname: params[:uname]).first