app/controllers/users_controller.rb

def create
  @user = User.new(
    fname: params[:user][:fname],
    lname: params[:user][:lname],
    uname: params[:user][:uname],
    email: params[:user][:email],
    password: params[:user][:password],
    city: params[:user][:city],
    occupation: params[:user][:occupation],
  )
  session[:current_user_id] = @user.id
  if @user.save
---
INSERT INTO "users" ("fname", "lname", "uname", "password", "email", "city", "occupation", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)

def update
  @user = User.find(params[:id])
  @user.fname = params[:user][:fname]
  @user.lname = params[:user][:lname]

  if @user.save
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 18], ["LIMIT", 1]]
UPDATE "users" SET "lname" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["lname", "DOg"], ["updated_at", 2017-05-30 04:52:35 UTC], ["id", 18]]